#+Title: Org-mode as a tool for reproducible research
#+Author: Evan Misshula
#+Email: emisshula@jjay.cuny.edu

#+TAGS:       Write(w) Update(u) Fix(f) Check(c) noexport(n) export(e)
#+OPTIONS: reveal_center:t reveal_progress:t reveal_history:nil reveal_control:t
#+OPTIONS: reveal_mathjax:t reveal_rolling_links:t reveal_keyboard:t reveal_overview:t num:nil
#+OPTIONS: reveal_width:1200 reveal_height:800
#+OPTIONS: toc:nil
#+REVEAL_MARGIN: 0.1
#+REVEAL_MIN_SCALE: 0.5
#+REVEAL_MAX_SCALE: 2.5
#+REVEAL_TRANS: cube
#+REVEAL_THEME: moon
#+REVEAL_HLEVEL: 2
#+REVEAL_HEAD_PREAMBLE: <meta name="description" content="Org-Reveal Introduction.">
#+REVEAL_POSTAMBLE: <p> Created by yjwen. </p>
#+REVEAL_PLUGINS: (highlight markdown)






* Initialize languages						     :export:
#+name: initialize_lang
#+source: configuration
#+begin_src emacs-lisp :results output :exports code
;; first it is necessary to ensure that Org-mode loads support for the
;; languages used by code blocks in this article
  (org-babel-do-load-languages
   'org-babel-load-languages
   '(
     (ditaa      . t)     
     (dot        . t)
     (emacs-lisp . t)
     (haskell    . t)
     (org        . t)
     (perl       . t)
     (python     . t)
     (R          . t)
     (ruby       . t)
     (sh         . t)
     (sqlite     . t)))
  ;; then we'll remove the need to confirm evaluation of each code
  ;; block, NOTE: if you are concerned about execution of malicious code
  ;; through code blocks, then comment out the following line
  (setq org-confirm-babel-evaluate nil)
  ;; finally we'll customize the default behavior of Org-mode code blocks
  ;; so that they can be used to display examples of Org-mode syntax
  (setf org-babel-default-header-args:org '((:exports . "code")))
#+end_src

#+RESULTS:

#+name: square
#+header: :var x=55
#+begin_src python :results value :exports none
return x*x
#+end_src

#+RESULTS: square
: 3025

* shell script tricks						     :export:
#+name: sort_files
#+begin_src sh :results output :exports both
  cd ~/Documents/rr  
  ls | sort
#+END_SRC 

#+RESULTS: sort_files
#+begin_example
3dscatter.R
3dscatter.R~
dav.org
gh
images
initialize.org
initialize.org~
mybib.bib
mybib.bib~
reveal.js
rr.html
rr.html~
rr.org
rr.org~
three_d_scatter.png
threed_scatter.png
#+end_example

